export default function Terms() {
  return (
    <div className='mx-auto px-[114px] py-[60px]'>
      <h1 className='mb-6 text-subtitle1 font-bold'>Пользовательское соглашение</h1>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>1. Термины и определения</h2>
        <p>
          <strong>1.1.</strong> Исполнитель – плательщик налога профессиональный налог Кортунов Дмитрий Вадимович.
        </p>
        <p>
          <strong>1.2.</strong> Пользователь — дееспособное физическое лицо (достигшее 16 лет и старше), оплатившее
          Подписку.
        </p>
        <p>
          <strong>1.3.</strong> Услуги — набор возможностей Сервиса Исполнителя, позволяющий Пользователю получить
          необходимые ему услуги VPN, технологией, которая позволяет установить безопасное подключение к сети интернет.
          При подключении к интернету через VPN программное обеспечение создаёт зашифрованное соединение между
          устройством пользователя и VPN-сервером, шифруя данные просмотра веб-страниц и скрывая IP-адрес.
        </p>
        <p>
          <strong>1.4.</strong> Подписка — предоставление Пользователю права доступа к Сервису, а также технические
          услуги по обеспечению доступа Пользователя к Сервису. Подписка предоставляется за определенную плату на
          определенный срок в соответствии с условиями, предусмотренными в настоящем Пользовательском соглашении.
        </p>
        <p>
          <strong>1.5.</strong> Сервис - @vpnhex_bot /{" "}
          <a href='https://hexvpn.vercel.app' className='text-accent underline'>
            hexvpn.vercel.app
          </a>
        </p>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>2. Предмет Пользовательского соглашения</h2>
        <p>
          <strong>2.1.</strong> Настоящее Пользовательское соглашение является публичной офертой в соответствии со ст.
          437 ГК РФ. Оплата Подписки является акцептом публичной оферты и подтверждает, что Пользователь полностью и
          безоговорочно принял все условия настоящего Пользовательского соглашения в соответствии со ст. 438 ГК РФ.
        </p>
        <p>
          <strong>2.2.</strong> Исполнитель обязуется предоставить Пользователю доступ к Сервису, а также оказывать
          технические услуги по обеспечению доступа Пользователя Сервису, а Пользователь обязуется оплатить Подписку на
          условиях и в порядке, предусмотренных настоящим Пользовательским соглашением.
        </p>
        <p>
          <strong>2.3.</strong> Исполнитель имеет право в одностороннем порядке и без предварительного уведомления
          Пользователя изменять условия настоящего Пользовательского соглашения, размеры, состав или содержание тарифов
          путем размещения соответствующего документа в новой редакции на Сервисе.
        </p>
        <p>
          <strong>2.4.</strong> Услуги, которые предоставляется Пользователям на платной основе, определяются
          Исполнителем самостоятельно и указываются в Тарифах.
        </p>
        <p>
          <strong>2.5.</strong> Настоящее Пользовательское соглашение является абонентским договором (ст. 429.4 ГК РФ).
          В связи с этим Пользователь не вправе требовать возврат денег, оплаченных за Подписку, ссылаясь на то, что в
          течение оплаченного срока он не воспользовался своим правом на получение услуг.
        </p>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>3. Порядок оказания услуг</h2>
        <p>
          <strong>3.1.</strong> Для получения услуг по Подписке Пользователь должен оплатить Подписку. После оплаты
          Подписки Пользователь автоматически получает доступ к Услугам по данным (логину и паролю в случае приобретения
          Подписки через сайт), указанным Пользователем при регистрации на Сервисе.
        </p>
        <p>
          <strong>3.2.</strong> Пользователь — физическое лицо не вправе передавать данные своей учетной записи другим
          лицам.
        </p>
        <p>
          <strong>3.3.</strong> Пользователь несет ответственность за сохранность предоставляемых аутентификационных
          данных (логина и пароля).
        </p>
        <p>
          <strong>3.4.</strong> Действия Пользователя для доступа к Сервису в целях его использования, в том числе
          действия, совершаемые с использованием логина и пароля, авторизация на Сервисе при помощи аккаунта учетной
          записи Пользователя в социальной сети, приравнивается Исполнителем и Пользователем к простой электронной
          подписи Пользователя.
        </p>
        <p>
          <strong>3.5.</strong> Информация об услугах, оказываемых Исполнителем, указывается непосредственно на Сервисе,
          в описании к каждому тарифу.
        </p>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>4. Оплата подписки. Отказ от подписки</h2>
        <p>
          <strong>4.1.</strong> Стоимость услуг зависит от выбранного Пользователем тарифа:
        </p>
        <div className='pl-8'>
          <p>
            <strong>4.1.1.</strong> Тариф Standard Plan:
          </p>
          <ul className='list-disc pl-8'>
            <li>Подписка сроком на 1 месяц – 249 рублей;</li>
            <li>Подписка сроком на 3 месяца – 687 рублей;</li>
            <li>Подписка сроком на 6 месяцев – 1194 рублей;</li>
            <li>Подписка сроком на 12 месяцев – 2028 рублей.</li>
          </ul>
          <p>
            <strong>4.1.2.</strong> Максимальное количество устройств – 3.
          </p>
          <p>
            <strong>4.1.3.</strong> Тариф Premium Plan:
          </p>
          <ul className='list-disc pl-8'>
            <li>Подписка сроком на 1 месяц – 499 рублей;</li>
            <li>Подписка сроком на 3 месяца – 1377 рублей;</li>
            <li>Подписка сроком на 6 месяцев – 2634 рублей;</li>
            <li>Подписка сроком на 12 месяцев – 4788 рублей.</li>
          </ul>
          <p>
            <strong>4.1.4.</strong> Максимальное количество устройств – 10.
          </p>
        </div>
        <p>
          <strong>4.2.</strong> Оплата Подписки производится Пользователем на условиях 100% предоплаты посредством
          Платежных систем, список которых можно увидеть при оплате Подписки.
        </p>
        <p>
          <strong>4.3.</strong> Исполнитель не хранит и не обрабатывает данные банковской карты Пользователя. Все
          операции по списанию денежных средств с банковской карты, а также хранение информации о банковских операциях
          осуществляет Платежная система.
        </p>
        <p>
          <strong>4.4.</strong> После успешной оплаты Пользователю будет направлен чек в электронной форме на
          предоставленный адрес электронной почты.
        </p>
        <p>
          <strong>4.5.</strong> Расчеты осуществляются в российских рублях.
        </p>
        <p>
          <strong>4.6.</strong> Обязанность Пользователя по оплате Подписки считается исполненной в момент зачисления
          средств на расчетный счет Исполнителя.
        </p>
        <p>
          <strong>4.7.</strong> Возврат средств, уплаченных Пользователем за Подписку возможен только в случае, если с
          момента активации подписки на следующий месяц прошло не более 2-х календарных дней.
        </p>
        <p>
          <strong>4.8.</strong> Сумма к возврату определяется как сумма средств, оплаченная Пользователем за Тариф за
          вычетом фактически понесенных Исполнителем расходов.
        </p>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>5. Права и обязанности Пользователя</h2>
        <p>
          <strong>5.1.</strong> Пользователь обязан:
        </p>
        <ul>
          <li>Соблюдать положения действующего законодательства РФ и настоящего Пользовательского соглашения.</li>
          <li>Не указывать данные третьих лиц с намерением выдать себя за другое лицо.</li>
        </ul>
        <p>
          <strong>5.2.</strong> Пользователь не вправе:
        </p>
        <ul>
          <li>
            Использовать Сервис любым иным способом, в том числе продавать и перепродавать, публично его
            демонстрировать, транслировать его по радио или телевидению.
          </li>
          <li>Использовать Сервис способом, который может помешать его нормальному функционированию.</li>
        </ul>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>6. Права и обязанности Исполнителя</h2>
        <p>
          <strong>6.1.</strong> Исполнитель обязуется предоставлять Пользователю по его запросу любую информацию,
          касающуюся Услуги и Подписки.
        </p>
        <p>
          <strong>6.2.</strong> В случае нарушения Пользователем правил, Исполнитель вправе прекратить оказание услуг,
          приостановить доступ Пользователя к Услугам Сервиса.
        </p>
        <p>
          <strong>6.3.</strong> Исполнитель вправе проводить акции, временно изменяющие стоимость и/или условия оказания
          услуг.
        </p>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>7. Интеллектуальная собственность</h2>
        <p>
          <strong>7.1.</strong> Все материалы, доступ к которым получает Пользователь, являются объектами исключительных
          прав Исполнителя.
        </p>
        <p>
          <strong>7.2.</strong> Материалы не могут быть скопированы, скачаны, переработаны или использованы без
          разрешения правообладателя.
        </p>
        <p>
          <strong>7.3.</strong> Никакие положения настоящего Пользовательского соглашения не предоставляют Пользователю
          право на использование фирменного наименования, товарных знаков Исполнителя.
        </p>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>8. Ограничение ответственности</h2>
        <p>
          <strong>8.1.</strong> Исполнитель не гарантирует, что услуги Сервиса и их качество будут соответствовать
          ожиданиям Пользователя.
        </p>
        <p>
          <strong>8.2.</strong> Некоторые инструменты, входящие в состав Услуг, предоставляют лишь приблизительные
          расчеты.
        </p>
        <p>
          <strong>8.3.</strong> Ответственность Исполнителя ограничена суммой в размере 1000 рублей.
        </p>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>9. Доступ к Сервису</h2>
        <p>
          <strong>9.1.</strong> Исполнитель оставляет за собой право изменить или модифицировать Сервис в любой момент.
        </p>
        <p>
          <strong>9.2.</strong> Исполнитель не гарантирует постоянную доступность Сервиса для Пользователя.
        </p>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>10. Заключительные положения</h2>
        <p>
          <strong>10.1.</strong> Настоящее Пользовательское соглашение регулируется законодательством Российской
          Федерации.
        </p>
        <p>
          <strong>10.2.</strong> Претензионный досудебный порядок урегулирования споров является обязательным.
        </p>
        <p>
          <strong>10.3.</strong> Признание судом какого-либо положения соглашения недействительным не влечет
          недействительности остальных положений.
        </p>
        <p>
          <strong>10.4.</strong> Соглашение вступает в силу с момента оплаты Подписки.
        </p>
      </section>

      <section className='mb-6'>
        <h2 className='mb-4 text-subtitle2 font-semibold'>11. Реквизиты Исполнителя</h2>
        <p>КОРТУНОВ ДМИТРИЙ ВАДИМОВИЧ</p>
        <p>ИНН: 772096284118</p>
        <p>
          E-mail:{" "}
          <a href='mailto:hexvpninfo@gmail.com' className='text-accent underline'>
            hexvpninfo@gmail.com
          </a>
        </p>
      </section>
    </div>
  );
}
